[
  {
    "id": "1",
    "slug": "the-shawshank-redemption",
    "title": "The Shawshank Redemption",
    "releaseYear": 1994,
    "genre": [
      "Drama"
    ],
    "director": "Frank Darabont",
    "cast": [
      "Tim Robbins",
      "Morgan Freeman",
      "Bob Gunton",
      "William Sadler"
    ],
    "rating": 9.3,
    "runtime": 142,
    "description": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency. A tale of hope, perseverance, and the enduring human spirit that has captivated audiences worldwide.",
    "posterUrl": "/images/shawshank.svg",
    "plot": "Andy Dufresne, a banker, is sentenced to life in Shawshank State Penitentiary for the murders of his wife and her lover, despite his claims of innocence. Over the following two decades, he befriends a fellow prisoner, contraband smuggler Ellis Boyd \"Red\" Redding, and becomes instrumental in a money-laundering operation led by the prison warden."
  },
  {
    "id": "2",
    "slug": "inception",
    "title": "Inception",
    "releaseYear": 2010,
    "genre": [
      "Sci-Fi",
      "Action",
      "Thriller"
    ],
    "director": "Christopher Nolan",
    "cast": [
      "Leonardo DiCaprio",
      "Joseph Gordon-Levitt",
      "Elliot Page",
      "Tom Hardy"
    ],
    "rating": 8.8,
    "runtime": 148,
    "description": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team.",
    "posterUrl": "/images/inception.svg",
    "plot": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state. Cobb's rare ability has made him a coveted player in treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved."
  },
  {
    "id": "3",
    "slug": "the-dark-knight",
    "title": "The Dark Knight",
    "releaseYear": 2008,
    "genre": [
      "Action",
      "Crime",
      "Drama"
    ],
    "director": "Christopher Nolan",
    "cast": [
      "Christian Bale",
      "Heath Ledger",
      "Aaron Eckhart",
      "Michael Caine"
    ],
    "rating": 9.0,
    "runtime": 152,
    "description": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
    "posterUrl": "/images/dark-knight.svg",
    "plot": "With the help of allies Lt. Jim Gordon and DA Harvey Dent, Batman has been able to keep a tight lid on crime in Gotham City. But when a vile young criminal calling himself the Joker suddenly throws the town into chaos, the caped Crusader begins to tread a fine line between heroism and vigilantism."
  },
  {
    "id": "4",
    "slug": "pulp-fiction",
    "title": "Pulp Fiction",
    "releaseYear": 1994,
    "genre": [
      "Crime",
      "Drama"
    ],
    "director": "Quentin Tarantino",
    "cast": [
      "John Travolta",
      "Uma Thurman",
      "Samuel L. Jackson",
      "Bruce Willis"
    ],
    "rating": 8.9,
    "runtime": 154,
    "description": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption. A groundbreaking film that redefined modern cinema.",
    "posterUrl": "/images/pulp-fiction.svg",
    "plot": "Vincent Vega and Jules Winnfield are hitmen with a penchant for philosophical discussions. Their storyline is interwoven with those of their boss, mob kingpin Marsellus Wallace, his actress wife Mia, struggling boxer Butch Coolidge, and a pair of small-time crooks named Pumpkin and Honey Bunny."
  },
  {
    "id": "5",
    "slug": "forrest-gump",
    "title": "Forrest Gump",
    "releaseYear": 1994,
    "genre": [
      "Drama",
      "Romance"
    ],
    "director": "Robert Zemeckis",
    "cast": [
      "Tom Hanks",
      "Robin Wright",
      "Gary Sinise",
      "Sally Field"
    ],
    "rating": 8.8,
    "runtime": 142,
    "description": "The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.",
    "posterUrl": "/images/forrest-gump.svg",
    "plot": "Forrest Gump, while not intelligent, has accidentally been present at many historic moments, but his true love, Jenny Curran, eludes him. His extraordinary journey through American history inspires generations with his simple wisdom and pure heart."
  },
  {
    "id": "6",
    "slug": "the-godfather",
    "title": "The Godfather",
    "releaseYear": 1972,
    "genre": [
      "Crime",
      "Drama"
    ],
    "director": "Francis Ford Coppola",
    "cast": [
      "Marlon Brando",
      "Al Pacino",
      "James Caan",
      "Robert Duvall"
    ],
    "rating": 9.2,
    "runtime": 175,
    "description": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son. A masterpiece of American cinema and the definitive gangster film.",
    "posterUrl": "/images/godfather.svg",
    "plot": "The Corleone family, led by patriarch Vito Corleone, is one of the most powerful crime families in New York. When Vito barely survives an assassination attempt, his youngest son Michael steps up to take care of the attackers, transforming himself into a ruthless mafia boss."
  }
]